
&НаКлиенте
Процедура Принять(Команда)
	
	ПослеЗакрытияВопроса(КодВозвратаДиалога.Да, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
        Возврат;
    ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ВладелецФормы.Элементы.ТаблицаДанныхExcelОбъект.ТекущиеДанные;
	
	Для Каждого ТекРеквизит Из ЭтотОбъект.Реквизиты Цикл
		Если ТекущиеДанные.Свойство(ТекРеквизит.Имя) Тогда
			ТекущиеДанные[ТекРеквизит.Имя] = ТекРеквизит.Значение;
		КонецЕсли;
	КонецЦикла;
	Если ВладелецФормы.Настройки_СохранятьТаблицаДанныхExcel Тогда
		ВладелецФормы.Модифицированность = Истина
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить изменения?';"
		    + " en = 'Do you want to continue?'"), РежимДиалогаВопрос.ДаНетОтмена, 0);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

