
&НаСервере
Процедура ЗагрузкаДанныхПриемНаРаботуНаСервере()
	ПараметрыЗагрузкиДанных = Новый Структура;
	ПараметрыЗагрузкиДанных.Вставить("ОтчетыПоЗагрузке", Новый Соответствие);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ТолькоПросмотр = Истина;
	ПараметрыЗагрузкиДанных.ОтчетыПоЗагрузке.Вставить("Отчет по загрузке данных", ТабДок);
	РеквизитФормыВЗначение("Объект").ЗагрузитьСуммыФСС(ДеСериализоватьОбъект(ОтладкаТекст), ПараметрыЗагрузкиДанных, Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхПриемНаРаботу(Команда)
	ЗагрузкаДанныхПриемНаРаботуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДеСериализоватьОбъект(СтрокаXML) Экспорт
	
	//Создаем объект чтения из XML
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	//Читаем таблицу значений из XML    
	ОбъектТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
 	
	Возврат ОбъектТЗ
КонецФункции
