
Процедура ЗагрузитьДниОтпусков(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Сотрудник,Организация,Месяц,ДатаРождения,ВидОтпуска,НачалоПериода,КонецПериода", "Дней");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	//НомПП      = ?(  ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация, 1, ПараметрыЗагрузкиДанных.НомерНачало);
	//НомППКонец = Мин(НомПП + ПараметрыЗагрузкиДанных.Шаг - 1,      ТаблицаДанныхExcel.Количество());
	ДокНомер = "ОстОтп";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "НачальныеОстаткиОтпусков";
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Набор1 = РегистрыСведений.НачальныеОстаткиОтпусков.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Дней = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стр           = Набор1.Добавить();
			стр.Сотрудник            = ДанныеСтроки.Сотрудник;
			стр.ВидЕжегодногоОтпуска = ДанныеСтроки.ВидОтпуска;
			стр.ДатаОстатка          = ДанныеСтроки.Месяц;
			стр.КоличествоДней       = ДанныеСтроки.Дней;
			стр.РабочийГодНачало     = ДанныеСтроки.НачалоПериода;
			стр.РабочийГодОкончание  = ДанныеСтроки.КонецПериода;
			стр.Период = НачалоМесяца(ДанныеСтроки.Месяц);

		КонецЦикла;
		
		Набор1.Записать();
		
	КонецЦикла;
	
	//ПараметрыЗагрузкиДанных.НомерНачало  = НомППКонец + 1;
	//ПараметрыЗагрузкиДанных.СписокОшибок = мСписокОшибок;
	
	//ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация  = Ложь;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьРасчеты(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	//ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Месяц,Подразделение,ВидНачисления", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	//НомПП      = ?(  ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация, 1, ПараметрыЗагрузкиДанных.НомерНачало);
	//НомППКонец = Мин(НомПП + ПараметрыЗагрузкиДанных.Шаг - 1,      ТаблицаДанныхExcel.Количество());
	ДокНомер = "ВЗ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "ВзаиморасчетыССотрудниками";
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "ЗарплатаКВыплате";
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Набор1 = РегистрыНакопления.ВзаиморасчетыССотрудниками.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		Набор2 = РегистрыНакопления.ЗарплатаКВыплате.СоздатьНаборЗаписей();
		Набор2.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стр           = Набор1.Добавить();
			стр.ВидДвижения = ВидДвиженияНакопления.Приход;
			стр.Период = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.Сотрудник            = ДанныеСтроки.Сотрудник;
			стр.ФизическоеЛицо       = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Подразделение        = ДанныеСтроки.Подразделение;
			стр.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий;
			стр.ВидВзаиморасчетов = Перечисления.ВидыВзаиморасчетовССотрудниками.ВыплатаЗарплаты;
			стр.СуммаВзаиморасчетов	 = ДанныеСтроки.Сумма;
			стр.Организация			 = ДанныеСтроки.Организация;

			стр           = Набор2.Добавить();
			стр.ВидДвижения = ВидДвиженияНакопления.Приход;
			стр.Период = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.Сотрудник            = ДанныеСтроки.Сотрудник;
			стр.ФизическоеЛицо       = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Организация			 = ДанныеСтроки.Организация;
			стр.Подразделение        = ДанныеСтроки.Подразделение;
			стр.ПериодВзаиморасчетов = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.СуммаКВыплате		 = ДанныеСтроки.Сумма;
			стр.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий;
			
		КонецЦикла;
		
		Набор1.Записать();
		Набор2.Записать();
		
	КонецЦикла;
	
	//ПараметрыЗагрузкиДанных.НомерНачало  = НомППКонец + 1;
	//ПараметрыЗагрузкиДанных.СписокОшибок = мСписокОшибок;
	
	//ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация  = Ложь;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьНДФЛ(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	//ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Месяц,Подразделение,ВидНачисления", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	//НомПП      = ?(  ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация, 1, ПараметрыЗагрузкиДанных.НомерНачало);
	//НомППКонец = Мин(НомПП + ПараметрыЗагрузкиДанных.Шаг - 1,      ТаблицаДанныхExcel.Количество());
	ДокНомер = "НДФЛ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "РасчетыНалогоплательщиковСБюджетомПоНДФЛ";
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "СведенияОДоходахНДФЛ";
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Набор1 = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		Набор2 = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
		Набор2.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.СуммаНДФЛ = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стр = Набор1.Добавить();
			стр.ВидДвижения       = ВидДвиженияНакопления.Приход;
			стр.Период            = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.МесяцНалоговогоПериода         = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.ДокументОснование = ДокСсылка;
			стр.ФизическоеЛицо    = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Подразделение     = ДанныеСтроки.Подразделение;
			стр.Сумма             = ДанныеСтроки.СуммаНДФЛ;
			стр.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента["Ставка" + ДанныеСтроки.Ставка];
			стр.Организация       = ДанныеСтроки.Организация;
			стр.ГоловнаяОрганизация            = ДанныеСтроки.Организация;
			стр.КодДохода         = ДанныеСтроки.КодДохода;
			
			стр           = Набор2.Добавить();
			стр.Период    = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.Сотрудник = ДанныеСтроки.Сотрудник;
			стр.ФизическоеЛицо         = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.ГоловнаяОрганизация    = ДанныеСтроки.Организация;
			стр.Организация            = ДанныеСтроки.Организация;
			стр.Подразделение          = ДанныеСтроки.Подразделение;
			стр.МесяцНалоговогоПериода = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.КодДохода = ДанныеСтроки.КодДохода;
			стр.КатегорияДохода        = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда;
			стр.СуммаДохода            = ДанныеСтроки.Сумма;
			стр.СуммаВычета            = ДанныеСтроки.СуммаНДФЛ;
			
		КонецЦикла;
		
		Набор1.Записать();
		Набор2.Записать();
		
	КонецЦикла;
	
	//ПараметрыЗагрузкиДанных.НомерНачало  = НомППКонец + 1;
	//ПараметрыЗагрузкиДанных.СписокОшибок = мСписокОшибок;
	
	//ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация  = Ложь;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьВзносыСальдо(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Организация,Месяц,ВидОбязательногоСтрахованияСотрудников,ЭтоРасчетыПоНачислениюУплатеВзносовВФСС", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	ДокНомер = "СВ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		РегистрИмя = "РасчетыСФондамиПоСтраховымВзносам";
		Если ДокСсылка.ТаблицаРегистров.Найти(РегистрИмя, "Имя") = Неопределено Тогда
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Стр       = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя   = РегистрИмя;
			ДокОбъект.Записать();
		КонецЕсли;

		Набор1 = РегистрыНакопления.РасчетыСФондамиПоСтраховымВзносам.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стр = Набор1.Добавить();
			стр.Период             = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.Организация        = ДанныеСтроки.Организация;
			стр.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС = ДанныеСтроки.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС;
			стр.ВидОбязательногоСтрахованияСотрудников  = ДанныеСтроки.ВидОбязательногоСтрахованияСотрудников;
			стр.ЭтоСтраховыеВзносы = Истина;
			стр.Сумма = ДанныеСтроки.Сумма;

		КонецЦикла;
		
		Набор1.Записать();
		
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьВзносыДоходы(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Подразделение,Месяц", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	ДокНомер = "СВ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		РегистрИмя = "СведенияОДоходахСтраховыеВзносы";
		Если ДокСсылка.ТаблицаРегистров.Найти(РегистрИмя, "Имя") = Неопределено Тогда
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Стр       = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя   = РегистрИмя;
			ДокОбъект.Записать();
		КонецЕсли;

		Набор1 = РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стр = Набор1.Добавить();
			стр.Период = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.ГоловнаяОрганизация = ДанныеСтроки.Организация;
			стр.Организация         = ДанныеСтроки.Организация;
			стр.Подразделение       = ДанныеСтроки.Подразделение;
			стр.Начисление          = ПланыВидовРасчета.Начисления.НайтиПоКоду("ОКЛ");
			стр.ВидДохода           = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			стр.Сотрудник           = ДанныеСтроки.Сотрудник;
			стр.ФизическоеЛицо      = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Сумма  = ДанныеСтроки.Сумма;

		КонецЦикла;
		
		Набор1.Записать();
		
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьВзносыОбороты(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Месяц,Организация,Сотрудник,Подразделение", "ПФР,ПФРСверхПредельной,ФСС,ФССНС,ФФОМС,ТФОМС");;
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	ДокНомер = "СВ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		РегистрИмя = "ИсчисленныеСтраховыеВзносы";
		Если ДокСсылка.ТаблицаРегистров.Найти(РегистрИмя, "Имя") = Неопределено Тогда
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Стр       = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя   = РегистрИмя;
			ДокОбъект.Записать();
		КонецЕсли;
		РегистрИмя = "СтраховыеВзносыПоФизическимЛицам";
		Если ДокСсылка.ТаблицаРегистров.Найти(РегистрИмя, "Имя") = Неопределено Тогда
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Стр       = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя   = РегистрИмя;
			ДокОбъект.Записать();
		КонецЕсли;

		Набор1 = РегистрыНакопления.ИсчисленныеСтраховыеВзносы.СоздатьНаборЗаписей();
		Набор1.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		Набор2 = РегистрыНакопления.СтраховыеВзносыПоФизическимЛицам.СоздатьНаборЗаписей();
		Набор2.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл

			стр1 = Набор1.Добавить();
			стр1.Период = НачалоМесяца(ДанныеСтроки.Месяц);
			стр1.ГоловнаяОрганизация     = ДанныеСтроки.Организация;
			стр1.Организация             = ДанныеСтроки.Организация;
			стр1.ФизическоеЛицо          = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр1.ПФРДоПредельнойВеличины = ДанныеСтроки.ПФР;
			стр1.ПФРСПревышения          = ДанныеСтроки.ПФРСверхПредельной;
			стр1.ФСС    = ДанныеСтроки.ФСС;
			стр1.ФССНесчастныеСлучаи     = ДанныеСтроки.ФССНС;
			стр1.ФФОМС  = ДанныеСтроки.ФФОМС;
			стр1.ТФОМС  = ДанныеСтроки.ТФОМС;

			стр2 = Набор2.Добавить();
			стр2.Период    = НачалоМесяца(ДанныеСтроки.Месяц);
			стр2.Организация             = ДанныеСтроки.Организация;
			стр2.Сотрудник = ДанныеСтроки.Сотрудник;
			стр2.ФизическоеЛицо          = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр2.ПФРДоПредельнойВеличины = ДанныеСтроки.ПФР;
			стр2.ПФРСПревышения          = ДанныеСтроки.ПФРСверхПредельной;
			стр2.ФСС       = ДанныеСтроки.ФСС;
			стр2.ФССНесчастныеСлучаи     = ДанныеСтроки.ФССНС;
			стр2.ФФОМС     = ДанныеСтроки.ФФОМС;
			стр2.ТФОМС     = ДанныеСтроки.ТФОМС;
			
		КонецЦикла;
		
		Набор1.Записать();
		Набор2.Записать();
		
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
