
Процедура ЗагрузитьДниЧасы(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Месяц", "Дней,Часов,ДнейШестидневка");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	//НомПП      = ?(  ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация, 1, ПараметрыЗагрузкиДанных.НомерНачало);
	//НомППКонец = Мин(НомПП + ПараметрыЗагрузкиДанных.Шаг - 1,      ТаблицаДанныхExcel.Количество());

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаряПомесячно.КалендарныхДней КАК КалендарныхДней,
		|	ДанныеПроизводственногоКалендаряПомесячно.Месяц КАК Месяц
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаряПомесячно КАК ДанныеПроизводственногоКалендаряПомесячно";
	
	ТЗКалендарь = Запрос.Выполнить().Выгрузить();
	
	ДокНомер = "ЗП_СЗО";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "ДанныеОВремениДляРасчетаСреднегоОбщий";
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Набор = РегистрыНакопления.ДанныеОВремениДляРасчетаСреднегоОбщий.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Дней = 0 Тогда
				Продолжить;
			КонецЕсли;
	
			стр           = Набор.Добавить();
			стр.Сотрудник = ДанныеСтроки.Сотрудник;
			стр.ОтработаноДней            = ДанныеСтроки.Дней;
			стр.ОтработаноДнейПятидневка  = ДанныеСтроки.Дней;
			стр.ОтработаноДнейШестидневка = ДанныеСтроки.ДнейШестидневка;
			стр.Период    				  = НачалоМесяца(ДанныеСтроки.Месяц);
			стр.ОтработаноЧасов           = ДанныеСтроки.Часов;
			стр.ОтработаноЧасовПятидневка = ДанныеСтроки.Часов;
			стр.ПорядокРасчета            = Перечисления.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление2010;
			стр.ОтработаноДнейКалендарных = ТЗКалендарь.Найти(НачалоМесяца(ДанныеСтроки.Месяц), "Месяц").КалендарныхДней;
			//ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЦикла;
	
	//ПараметрыЗагрузкиДанных.НомерНачало  = НомППКонец + 1;
	//ПараметрыЗагрузкиДанных.СписокОшибок = мСписокОшибок;
	
	//ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация  = Ложь;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьСуммыФСС(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	// Отчет по загрузке (возможно добавить несколько).
	Макет = ПолучитьМакет("МакетОшибокФСС");
	ОбластьЗаголовок        = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал           = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы     = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы    = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОрганизация      = Макет.ПолучитьОбласть("Организация");
	ОбластьМесяц            = Макет.ПолучитьОбласть("Месяц");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ТолькоПросмотр = Истина;
	ПараметрыЗагрузкиДанных.ОтчетыПоЗагрузке.Вставить("Отчет по загрузке данных", ТабДок);

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Месяц,СоставнаяЧасть,ОблагаетсяЕНВД,Индексируется,Год,КоличествоМесяцев", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц", "Сумма");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	ДокНомер = "ЗП_СЗОЗ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка;
			ДокОбъект = ДокСсылка.Получитьобъект();
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Если ДокОбъект.ТаблицаРегистров.Найти("ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС", "Имя") = Неопределено Тогда
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС";
		КонецЕсли;
		ДокОбъект.Записать();
		
		ОбластьМесяц.Параметры.Заполнить(ДанныеСтрокиГрупп);
		ОбластьМесяц.Параметры.Документ = ДокОбъект.Ссылка;
		ТабДок.Вывести(ОбластьМесяц, 1);
		
		Набор = РегистрыНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ДанныеСтроки);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, 2);
			
			//Организация,Сотрудник,Месяц,СоставнаяЧасть,ОблагаетсяЕНВД,Индексируется", "Год,КоличествоМесяцев,Сумма
			
			стр           = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(стр, ДанныеСтроки);
			стр.ПорядокРасчета = Перечисления.ПорядокРасчетаСреднегоЗаработкаФСС.Постановление2011;
			стр.ГоловнаяОрганизация = ДанныеСтроки.Организация;
			стр.ФизическоеЛицо = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Период    	   = НачалоМесяца(ДанныеСтроки.Месяц);
			
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗагрузитьСуммы(ТаблицаДанныхExcel, ПараметрыЗагрузкиДанных, СтандартнаяОбработка) Экспорт
	
	ТаблицаДанныхExcel.Свернуть("Организация,Сотрудник,Месяц,СоставнаяЧасть,ОблагаетсяЕНВД,Индексируется,Год,КоличествоМесяцев", "Сумма");
	
	ТаблицаДанныхExcelГрупп = ТаблицаДанныхExcel.Скопировать();
	ТаблицаДанныхExcelГрупп.Свернуть("Организация,Месяц");
	ТаблицаДанныхExcelГрупп.Сортировать("Организация,Месяц");
	
	//НомПП      = ?(  ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация, 1, ПараметрыЗагрузкиДанных.НомерНачало);
	//НомППКонец = Мин(НомПП + ПараметрыЗагрузкиДанных.Шаг - 1,      ТаблицаДанныхExcel.Количество());
	ДокНомер = "ЗП_СЗОЗ";
	
	Для Каждого ДанныеСтрокиГрупп Из ТаблицаДанныхExcelГрупп Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПереносДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереносДанных КАК ПереносДанных
			|ГДЕ
			|	ПереносДанных.ПериодРегистрации = &ПериодРегистрации
			|	И ПереносДанных.Организация = &Организация
			|	И ПереносДанных.Номер = &Номер
			|	И ПереносДанных.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", ДокНомер);
		Запрос.УстановитьПараметр("Организация", ДанныеСтрокиГрупп.Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДанныеСтрокиГрупп.Месяц));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка;
			ДокОбъект = ДокСсылка.Получитьобъект();
		Иначе
			ДокОбъект = Документы.ПереносДанных.СоздатьДокумент();
			ДокОбъект.Дата = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Номер             = ДокНомер;
			ДокОбъект.ПериодРегистрации = НачалоМесяца(ДанныеСтрокиГрупп.Месяц);
			ДокОбъект.Организация       = ДанныеСтрокиГрупп.Организация;
			ДокОбъект.Записать();
			ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;
		
		Если ДокОбъект.ТаблицаРегистров.Найти("ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий", "Имя") = Неопределено Тогда
			Стр            = ДокОбъект.ТаблицаРегистров.Добавить();
			Стр.Имя        = "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий";
		КонецЕсли;
		ДокОбъект.Записать();
		
		Набор = РегистрыНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		ПоискДанных = Новый Структура("Организация,Месяц");	ЗаполнитьЗначенияСвойств(ПоискДанных, ДанныеСтрокиГрупп);
		Для Каждого ДанныеСтроки Из ТаблицаДанныхExcel.НайтиСтроки(ПоискДанных) Цикл
			
			Если ДанныеСтроки.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//Организация,Сотрудник,Месяц,СоставнаяЧасть,ОблагаетсяЕНВД,Индексируется", "Год,КоличествоМесяцев,Сумма
			
			стр           = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(стр, ДанныеСтроки);
			стр.ПорядокРасчета = Перечисления.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление2010;
			стр.ФизическоеЛицо = ДанныеСтроки.Сотрудник.ФизическоеЛицо;
			стр.Период    	   = НачалоМесяца(ДанныеСтроки.Месяц);
			
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЦикла;
	
	//ПараметрыЗагрузкиДанных.НомерНачало  = НомППКонец + 1;
	//ПараметрыЗагрузкиДанных.СписокОшибок = мСписокОшибок;
	
	//ПараметрыЗагрузкиДанных.ЭтоНачальнаяИтерация  = Ложь;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
