
&НаСервере
Процедура УКО_ПодключитьНаСервере(ДанныеОбработки, УникальныйИдентификатор)

	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДанныеОбработки, УникальныйИдентификатор);
	ИмяОбработки 	 = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,,Ложь);
	ОбъектОбработка = ВнешниеОбработки.Создать(ИмяОбработки);
			
КонецПроцедуры

&НаКлиенте
Процедура УКО_Подключить(Команда)
	ДвочныеДанные = Новый ДвоичныеДанные(УКО_Путь);
	УКО_ПодключитьНаСервере(ДвочныеДанные, ВладелецФормы.УникальныйИдентификатор);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УКО_ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Фильтр = "Файл обработки(*.epf)|*.epf";
	Расширение = "epf";
	
	ДиалогОткрытияФайла.ПолноеИмяФайла	   = УКО_Путь;
	ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.Заголовок          = "Выберите файл УКО";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		УКО_Путь = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
